Table of Contents
 Class IdeaFoldedPlate
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaFoldedPlate : AbstractIdeaObject<IIdeaFoldedPlate>, IEquatable<AbstractIdeaObject<IIdeaFoldedPlate>>, IIdeaFoldedPlate, IIdeaObjectConnectable, IIdeaPersistentObject, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaFoldedPlate>
IdeaFoldedPlate
Implements
IEquatable<AbstractIdeaObject<IIdeaFoldedPlate>>
IIdeaFoldedPlate
IIdeaObjectConnectable
IIdeaPersistentObject
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaFoldedPlate>.Id
 AbstractIdeaObject<IIdeaFoldedPlate>.Name
 AbstractIdeaObject<IIdeaFoldedPlate>.Identifier
 AbstractIdeaObject<IIdeaFoldedPlate>.GetHashCode()
 AbstractIdeaObject<IIdeaFoldedPlate>.Equals(object)
 AbstractIdeaObject<IIdeaFoldedPlate>.Equals(AbstractIdeaObject<IIdeaFoldedPlate>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaFoldedPlate(Identifier<IIdeaFoldedPlate>)
protected IdeaFoldedPlate(Identifier<IIdeaFoldedPlate> identifer)
Parameters
identifer Identifier<IIdeaFoldedPlate>
 IdeaFoldedPlate(int)
public IdeaFoldedPlate(int id)
Parameters
id int
 IdeaFoldedPlate(string)
public IdeaFoldedPlate(string id)
Parameters
id string
Properties
 Bends
Collection of plates
public IEnumerable<IIdeaBend> Bends { get; set; }
Property Value
IEnumerable<IIdeaBend>
 Plates
Collection of plates
public IEnumerable<IIdeaPlate> Plates { get; set; }
Property Value
IEnumerable<IIdeaPlate>
 Token
Persistence token. Holds data neccessery to recreated the object in future.
public virtual IIdeaPersistenceToken Token { get; set; }
Property Value
IIdeaPersistenceToken
 Edit this page